GetStream/stream-video-esp32/examples/minimal/sdkconfig.defaults
# Default SDK configuration for minimal example
# This file provides default settings for ESP32-S3

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# WiFi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_AMSDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_NVS_ENABLED=y

# WebSocket
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Stream Video
CONFIG_STREAM_VIDEO_FORCE_RELAY=n
CONFIG_STREAM_VIDEO_STUN_OVERRIDE=""
CONFIG_STREAM_VIDEO_VENC_TASK_STACK=131072

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Camera + SCCB (I2C)
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
CONFIG_OV3660_SUPPORT=y
CONFIG_SCCB_HARDWARE_I2C=y
CONFIG_SCCB_HARDWARE_I2C_PORT0=y
CONFIG_SCCB_CLK_FREQ=100000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_LWIP_DNS_MAX_SERVERS=3
CONFIG_LWIP_DNS_FALLBACK_SERVER=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# PSRAM (required for camera + H264)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Camera DMA tuning (reduce internal DMA block size)
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=16384
CONFIG_CAMERA_PSRAM_DMA=n

# mbedTLS - Enable DTLS-SRTP support for WebRTC (required by esp_peer)
CONFIG_MBEDTLS_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_CONNECTION_ID=y
CONFIG_MBEDTLS_SSL_DTLS_ANTI_REPLAY=y
CONFIG_MBEDTLS_SSL_DTLS_CLIENT_PORT_REUSE=y
CONFIG_MBEDTLS_SSL_DTLS_BADMAC_LIMIT=10
CONFIG_MBEDTLS_SSL_DTLS_HANDSHAKE_TIMEOUT=60000

